a = 1 # целое число
a = 1.0 # вещественное число
a = 1 + 1j # комплексное число
a = True # булевое значение
a = None # пустой тип
a = 'hello' # строка
a = [1, 1.1,'hello'] # список
a = (1, 1.1,'hello') # кортеж
a = {1, 1.1,'hello'} # множество
a = frozenset({1,1.0,'hello'}) # неизменяемое множество
a = {'a': 1, 'b':2} # словарь
a = b'hello' #байтовый словарь
a = bytearray(b'hello')
a = [1, 1.0, 'hello'] # создаем список
help(a) # выводим информацию об 'a'
b = input('Введите число') # в консоль выводится сообщние и ожидается когда пользователь введет число
len(a) # сколько объектов в 'a'
min(a) # минимальное значение в 'a'
max(a) # максимальное значение в 'a'
type(a) # тип объекта 'a'
a = 1
a = 'новое значение переменной 'a'
