# for value in collection:
# # Начало блока кода с телом цикла
# ...
# ...
# ...
# # Конец блока кода с телом цикла
# # Код, который будет выполняться после цикла
#
#  a = {1: 'x', 2: 'y', 3: 'z'}
#  for index, value in a.items():
#      print(f'"Позиция: {index} -> Значение: {value}"')
#
# range(10)
# # Генерация последовательности чисел от 0 до 9
# range(1, 11)
# # Генерация последовательности чисел от 1 до 10
# range(1, 11, 2)
# # Генерация последовательности чисел от 1 до 10 с шагом 2
# range(10, 0, -1)
# # Генерация последовательности чисел от 10 до 1 с шагом -1

# # ВЫЧИСЛЕНИЕ АЛГОРИТМА 1
# a, s, p = 1, 150, 200
# for i in range(1, 11):
#     while a <= 10:
#       a += 2
#       p += a
#       s += p
#       print(s)

# # ВЫЧИСЛЕНИЕ АЛГОРИТМА 2
# c, d = 750, 90
# while d > 0:
#     d = d - 10
#     c = c/2 + 50
#     print(c)


