a = [1, 1.1, 'a',[1], (1, 1.1), {1, 2}, {'a': 1}, None, True] # Список в котором целое; вещественное; строковое; другой список; кортеж; множество; словарь; пустой тип; булевой тип.
a = [] # Пустой список
b = list() # Пустой список
a = (1, 2.1, 3) # Раньше я был кортежем
list(a) #[1, 2.1, 3] но 'a' остался кортежем
b = list('abc') # ['a','b','c']
a = [1, 1.1, 'a']
print(a)
print([1, 1.1, 'a'])a = [1, 1.1, 'a']
a[0]
a[1]
a[2]
a[3]
a[-1]
a[-2]
a[-3]
a[-4]
a = [1, 2, 3]
a.index(3)
a = [1, 1.1, 'a']
a[0] = 'a'
a[1] = 'б'
a[-1] = 'в'
a = [1, 2, 3]
a =[1, 2, 3]
a.append(4)
a.append(['a','b'])
a = [1, 2, 3]
a.insert(0, 4)
a = [1, 2, 3]
a.insert(-1, 4)
a = [1, 2, 3]
a.extend([4, 5, 6])
a =[1, 1.1, 'a']
del a[0]
del a[-1]
del a[-1]
del a
a =[1, 2, 3]
a.clear()
a = [1, 2, 3]
a = [1, 2, 3]
a.pop()
a = [1, 2, 'ab']
a.remove('ab')
a = [1, 2, 3]
b = [4, 5, 6]
c = a + b
print(c)
a += b
a = [1, 2, 3]
b = 2
c = a *  b
print(c)
a *=b
a = [1, 2, 3]
b = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
b = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
b[0]
b[0][0]
b(-1)[-1]
help(list)
a = [1, 1, 3.1]
a.count(1)
a = [1, 2, 3]
a.copy()
a = [1, 2, 3]
a = [2, 1, 3]
a = [2, 1, 3]
a.sort(reverse=True)
a = [1, 2, [1, 2, 3]]
b = a.copy()
b[2][0] = 10
print(a)
b[0] = 10
print(a)
from copy import deepcopy
a = [1, 2, [1, 2, 3]]
b = deepcopy(a)
b[2][0] = 10
print(a)
a = [[0, 0, 0], [0, 0, 0], [0, 0, 0]]
b = [[0] * 3] * 3
a[0][0] = 1
b[0][0] = 1